// 1)ასაკის შემოწმება
// დავალება: შექმენი ცვლადი age. გამოიყენე ternary operator-ი იმის დასადგენად, არის თუ არა ადამიანი სრულწლოვანი.

// თუ age არის 18 ან მეტი, დაუბეჭდე: "შენ ხარ სრულწლოვანი".

// თუ ნაკლებია, დაუბეჭდე: "შენ ხარ არასრულწლოვანი".

let age = 18
age >=18 ? console.log( "shen xar srulwlovani"): console.log("child");



// 2)ლუწია თუ კენტი?
// დავალება: მოცემულია რიცხვი number.

// დაწერე კოდი, რომელიც შეამოწმებს რიცხვის ნაშთს 2-ზე გაყოფისას.

// თუ ნაშთი 0-ია, გამოიტანე ტექსტი "ლუწია", წინააღმდეგ შემთხვევაში – "კენტია"

let number = 2

number %2 == 0 ? console.log("even"):console.log("odd");


// 3)ფასდაკლების სისტემა
// დავალება: გაქვს ცვლადი totalPrice (მაგალითად, 150 ლარი).

// თუ totalPrice აღემატება 100 ლარს, მიანიჭე ცვლადს discount მნიშვნელობა "20% ფასდაკლება".

// თუ ნაკლებია, მიანიჭე "ფასდაკლების გარეშე".



let totalPrice = 150

totalPrice >100 ? totalPrice = "20% fasdakleba" :totalPrice = "fasdaklebis gareshe";
console.log(totalPrice)

// 4)კვირის დღეები
// დავალება: გაქვს ცვლადი dayNumber, რომელიც შეიცავს რიცხვს 1-დან 7-მდე.

// გამოიყენე switch, რომ რიცხვის მიხედვით გამოიტანო კვირის შესაბამისი დღის სახელი (მაგალითად: 1 - "ორშაბათი", 2 - "სამშაბათი" და ა.შ.).

// აუცილებლად დაამატე default ბლოკი იმ შემთხვევისთვის, თუ რიცხვი 1-დან 7-მდე არ არის (მაგ: დაუბეჭდე "არასწორი რიცხვი").











// 5)შუქნიშნის ფერები
// დავალება: შექმენი ცვლადი color და მიანიჭე მას ტექსტური მნიშვნელობა ("წითელი", "ყვითელი" ან "მწვანე").

// case "წითელი": დაბეჭდე "გაჩერდი!"

// case "ყვითელი": დაბეჭდე "მოემზადე"

// case "მწვანე": დაბეჭდე "შეგიძლია იმოძრაო"

// default: დაბეჭდე "შუქნიშანი გაფუჭებულია"

    


[0] === 0
[0] == 0 